# * * * * * * * * * *
# print("* * * * * * * * * *")
# print("* "*10)
# for i in range(10):
#     print("*", end=" ")

# ex1 با سه روش بالا
'''
* * * * * * * * * *
* * * * *
* * * * * * * * * * * * * * * * * * * *
'''


'''
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *
* * * * * * * * * *
'''

for row in range(8):
    for col in range(10):
        print("*", end=" ")
    print()

# ex:
'''
* * * * *
* * * * *
* * * * *
* * * * *
* * * * *
* * * * *
* * * * *
* * * * *
* * * * *
* * * * *
'''

'''
* * * * * * * * * * * * * * * * * * * *
* * * * * * * * * * * * * * * * * * * *
* * * * * * * * * * * * * * * * * * * *
* * * * * * * * * * * * * * * * * * * *
* * * * * * * * * * * * * * * * * * * *
'''

'''
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8 9

'''
# for row in range(10):
#     for col in range(10):
#         print(col, end=" ")
#     print()


'''
0 0 0 0 0 0 0 0 0 0
1 1 1 1 1 1 1 1 1 1
2 2 2 2 2 2 2 2 2 2
3 3 3 3 3 3 3 3 3 3
4 4 4 4 4 4 4 4 4 4
5 5 5 5 5 5 5 5 5 5
6 6 6 6 6 6 6 6 6 6
7 7 7 7 7 7 7 7 7 7
8 8 8 8 8 8 8 8 8 8
9 9 9 9 9 9 9 9 9 9
'''
# for i in range(10):
#     for j in range(10):
#         print(i, end=" ")
#     print()


'''
0
0 1
0 1 2
0 1 2 3
0 1 2 3 4
0 1 2 3 4 5
0 1 2 3 4 5 6
0 1 2 3 4 5 6 7
0 1 2 3 4 5 6 7 8
0 1 2 3 4 5 6 7 8 9

'''

# for row in range(10):
#     for col in range(row + 1):
#         print(col , end= " ")
#     print()


'''
0 1 2 3 4 5 6 7 8 9
0 1 2 3 4 5 6 7 8
0 1 2 3 4 5 6 7
0 1 2 3 4 5 6
0 1 2 3 4 5
0 1 2 3 4
0 1 2 3
0 1 2
0 1
0

'''
# for row in range(10, -1, -1):
#     for col in range(row):
#         print(col, end=" ")
#     print()

'''
1  2  3  4  5  6  7  8  9
2  4  6  8  10 12 14 16 18
3  6  9  12 15 18 21 24 27
4 8 12 16 20 24 28 32 36
5 10 15 20 25 30 35 40 45
6 12 18 24 30 36 42 48 54
7 14 21 28 35 42 49 56 63
8 16 24 32 40 48 56 64 72
9 18 27 36 45 54 63 72 81


'''
for row in range(1,10):
    for col in range(1,10):
        if row * col < 10:
            print(" ",end="")
        print(row * col , end=" ")
    print()


# x = 10

# if x < 10:
#     print("x is less than 10")
# elif 10 < x < 12:
#     print("blalalall")
# else:
#     print("x is not less than 10")

# age = 8

# if age < 8:
#     print("kid")
# elif 8 < age < 13:
#     print("junior")
# elif 13 < age < 18:
#     print("teenager")
# else:
#     print("adult")


#  برنامه ای بنویس که نمرات سه درس دانش آموز را از ورودی بگیرد و
# در صورتی که معدلش بیشتر نود بود
# A
# بیشتر از هشتاد بود
# B
# بیشتر از هفتاد بود 
# C

# بیشتر از 60
# D